# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 4 # number of classes
depth_multiple: 1.33 # model depth multiple
width_multiple: 1.25 # layer channel multiple

anchors:
  # - [22, 50, 23, 64, 28, 77] # P3/8
  # - [33, 92, 39, 108, 42, 124] # P4/16
  # - [46, 142, 53, 163, 63, 190] # P5/32
  # - [71, 224, 79, 261, 92, 315] # P6/64

  - [24, 52, 26, 71, 35, 93]
  - [41, 119, 103, 76, 49, 147]
  - [61, 186, 184, 83, 264, 77]
  - [75, 240, 422, 69, 90, 307]

  # - [24, 64, 40, 112, 64, 56]
  # - [112, 176, 48, 128, 32, 64] 
  # - [32, 128, 64, 224, 192, 64] 
  # - [320, 64, 64, 256, 128, 320]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, MultiStreamConv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, MultiStreamConv, [128, 3, 2]], # 1-P2/4
    [-1, 3, MultiStreamC3, [128]],
    [-1, 1, Fusion, ['concat', 2]],
    [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
    [-1, 6, C3, [256]],
    [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
    [-1, 9, C3, [512]],
    [-1, 1, Conv, [768, 3, 2]], # 7-P5/32
    [-1, 3, C3, [768]],
    [-1, 1, Conv, [1024, 3, 2]], # 9-P6/64
    [-1, 3, C3, [1024]],
    [-1, 1, SPPF, [1024, 5]], # 11
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, Conv, [768, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 8], 1, Concat, [1]], # cat backbone P5
    [-1, 3, C3, [768, False]], # 15

    [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]], # cat backbone P4
    [-1, 3, C3, [512, False]], # 19

    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Concat, [1]], # cat backbone P3
    [-1, 3, C3, [256, False]], # 23 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 20], 1, Concat, [1]], # cat head P4
    [-1, 3, C3, [512, False]], # 26 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 16], 1, Concat, [1]], # cat head P5
    [-1, 3, C3, [768, False]], # 29 (P5/32-large)

    [-1, 1, Conv, [768, 3, 2]],
    [[-1, 12], 1, Concat, [1]], # cat head P6
    [-1, 3, C3, [1024, False]], # 32 (P6/64-xlarge)

    [[23, 26, 29, 32], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5, P6)
  ]
